<template>
  <div class="wenzhang2">
    <h1>黑客破坏攻击的常用入侵方法</h1>
    <div style="text-align: left;text-indent: 2em;font-size: 17px;letter-spacing: 1px;">
      <p> (1)口令入侵:
        意思就是用一些软件解开已经得到但被人加密的口令文档，不过许多黑客已大量采用一种可以饶开或屏蔽口令保护的程序来删除密码数据，跳过密码检测，更改密码
        结果，强行进入网络系统。对于那些可以揭开或屏蔽口令保护的程序通常被称为“Crack”。由于这些软件的广为流传，使得入侵电脑网络系统有时变得相当简 单，一般不需要很深入了解系统的内部结构。</p>
      <p>(2)木马:
        他最经典的做法可能就是把一个能帮忙黑客完成某一特定动作的程序依附在一个合法用户的正常程序中，这时合法用户的程序代码已被修改，一旦用户触发该程序，
        那么依附在内的黑客指令代码同时被激活，这些代码往往能完成黑客指定的任务。由于这种入侵法需要黑客有很好的编程经验，且要更改代码，要一定的权限，所以
        较难掌握。但正因为它的复杂性，一般的系统管理员很难发现。它通常在用户收发E-mail或浏览网页时，借机潜入用户的计算机系统中。</p>
      <p>(3)监听法:
        这是一个很实用但风险很大的黑客入侵方法，但还是有很多入侵系统的黑客高手采用此类方法。
        网 络节点或工作站之间的交流是通过信息流的传送得以实现，而当在一个没有集线器的网络中，数据的传输并没有指明特定的方向，这是每一个网络节点或工作站都是
        一个接口。这时如果有某个信息发来，所有的系统接口都受到了这个信息，一旦某个工作站或节点是这个信息的目的位置并完成接受，联接就马上完成。
        有一种叫sniffer的软件，它可以截获这些信息，也就相应的截获口令和秘密的信息，可以共来攻击相邻的网络。</p>
      <p>(4)E-mail技术:
        黑客有时也会以E-mail形式向用户寄发轰炸信息，由于一般情况下用户收到的E-mail都含有发件人的地址，那么自然也可以根据发件人的地址追查黑
        客。黑客们自有高招，他们根本不采用普通的E-mail系统，而是利用匿名E-mail传递系统给用户寄发E-mail，从这种E-mail中是无法获得
        黑客的真实地址的，因E-mail传递系统是一种可以隐匿发件人邮件地址的计算机服务系统。</p>
      <p>(5)利用系统漏洞:
        操作系统是一个复杂庞大的软软件，有时因为程序员的疏忽或软件设计上的失误，可能会留下一些落动，着就是我们常说的BUG，从而成为黑客进入网络的一个后门
        以上知识黑客们入侵的很小一部分手段，而现今的世界各地的黑客正以飞快的速度创造出更新的入侵手段！</p>
    </div>
  </div>
</template>

<script>
</script>

<style>
</style>
