<template>
  <div class="wenzhang3">
    <h1>Linux入门的一些基本知识整理</h1>
    <div style="text-align: left;text-indent: 2em;font-size: 17px;">
      <h2>图形模式与文字模式的切换方式</h2>
      <p>Linux预设提供了六个命令窗口终端机让我们来登录。
        默认我们登录的就是第一个窗口，也就是tty1，这个六个窗口分别为tty1、tty2 … tty6，你可以按下Ctrl + Alt + F1 ~ F6 来切换它们。
        如果你安装了图形界面，默认情况下是进入图形界面的，此时你就可以按Ctrl + Alt + F1 ~ F6来进入其中一个命令窗口界面。
        当你进入命令窗口界面后再返回图形界面只要按下Ctrl + Alt + F7 就回来了。
        如果你用的vmware 虚拟机，命令窗口切换的快捷键为 Alt + Space + F1~F6。
        如果你在图形界面下请按Alt + Shift + Ctrl + F1~F6 切换至命令窗口。</p>
      <h2>学会使用快捷键</h2>
      <p>Ctrl + C：这个是用来终止当前命令的快捷键，当然你也可以输入一大串字符，不想让它运行直接Ctrl + C，光标就会跳入下一行。
        Tab：这个键是最有用的键了，也是很多人敲击概率最高的一个键。因为当你打一个命令打一半时，它会帮你补全的。不光是命令，当你打一个目录时，同样可以补全，不信你试试。
        Ctrl + D：退出当前终端，同样你也可以输入exit。
        Ctrl + Z：暂停当前进程，比如你正运行一个命令，突然觉得有点问题想暂停一下，就可以使用这个快捷键。暂停后，可以使用fg恢复它。
        man + 命令：输入man ls其实格式为man + 命令，你就会看到相关的帮助文档了。从命令的介绍到命令的参数以及用法介绍的都非常详细的，不错吧。
        Ctrl + L：清屏，使光标移动到第一行。</p>
      <h2>Linux系统目录结构</h2>
      <p>登录系统后，在当前命令窗口下输入 ls / 你会看到</p>
      <img src="../assets/t3.jpeg" style="text-align: left;" />
      <h2>学会查询帮助文档 — man</h2>
      <p>这个man 通常是用来看一个命令的帮助文档的。例如：</p>
      <img src="../assets/t4.jpeg" style="text-align: left;" />
      <p>在linux系统中，有几个目录是比较重要的，平时需要注意不要误删除或者随意更改内部文件。/etc：上边也提到了，这个是系统中的配置文件，如果你更改了该目录下的某个文件可能会导致系统不能启动。/bin, /sbin,
        /usr/bin, /usr/sbin: 这是系统预设的执行文件的放置目录，比如 ls 就是在/bin/ls 目录下的。</p>
      <p>值得提出的是，/bin, /usr/bin 是给系统用户使用的指令(除root外的通用户)，而/sbin, /usr/sbin
        则是给root使用的指令。/var：这是一个非常重要的目录，系统上跑了很多程序，那么每个程序都会有相应的日志产生，而这些日志就被记录到这个目录下，具体在/var/log 目录下，另外mail的预设放置也是在这里。</p>
      <h2>如何正确关机</h2>
      <p>linux和windows不同，在 Linux
        底下，由于每个程序(或者说是服务)都是在在背景下执行的，因此，在你看不到的屏幕背后其实可能有相当多人同时在你的主机上面工作，例如浏览网页啦、传送信件啦以FTP传送档案啦等等的，如果你直接按下电源开关来关机时，则其它人的数据可能就此中断。此外，最大的问题是，若不正常关机，则可能造成文件系统的毁损（因为来不及将数据回写到档案中，所以有些服务的档案会有问题）。</p>
    </div>
  </div>
</template>

<script>
</script>

<style>
</style>
